'use strict';

async function renderBitumAboutUs() {
    const bitum = await getBitum();

    document.title = `${bitum.groupName} | ${bitum.navigationMenu[1].title}`;

    // About Us
    const breadcrumbAboutUs = document.querySelector('#breadcrumbAboutUs');
    breadcrumbAboutUs.innerHTML = `<ol class="breadcrumb">
                                       <li class="breadcrumb-item"><a href="${bitum.navigation.home.linkHome}">${bitum.navigation.home.titleHome} </a></li>
                                       <li class="breadcrumb-item active">${bitum.navigation.aboutUs.titleAboutUs}</li>
                                   </ol>`;
    
    const titleAboutUs = document.querySelector('#titleAboutUs');
    titleAboutUs.innerHTML = `${bitum.aboutUs.title}`;
    
    const aboutUsContent = document.querySelector('#aboutUsContent');
    aboutUsContent.innerHTML = `<p>Все почалося зі знайомства ONEALa (Олександрія) та Stee Jay'я (Нікополь) у дніпропетровському залізничному університеті, 
                                    Stee Jay показав як користуватися початковими програмами для створення музики, разом вони записали 3 демо треки 
                                    (мелодія, війна та ALEXANDRIA-NIKOPOL connection - який згодом став Олександрією).
                                </p>
                                <p>
                                Перший раз ONEAL виступив сам у ДК Етал на дні міста 2003 в Олександрії, в цей же день він зустрівся зі своїм другом 
                                    і колишнім сусідом (з яким не бачилися 6 років) Владом, виявилося, Влад теж слухає реп і ONEAL розповів йому чим займається, 
                                    наступного раз вони зустрілися вже на сливі, де Оніл познайомився з ЕNERом, (до цього NR гасив на вулиці, слухав gungsta rap, 
                                    на вулиці він був досить відомий), також на сливі був присутній Дема (найстаріший друг ONEALу, на той момент слухав реп і альтернативу,
                                    є більше другом групи ніж її повноцінним учасником, з ним було записано кілька треків), 
                                    також ще пара дрібних друзів яким з ними, як виявилося, було не по дорозі).
                                <p>
                                <p>
                                Було вирішено записати кілька треків – подивитися що вийде, але поки що не було на чому. 12 серпня 2003 р. у ONEALа з'явився комп'ютер 
                                    (спасибі мамі). ONEAL одразу сів робити якісь мінуси. Тієї ж ночі був записаний 1 спільний трек але краще про нього не згадувати - це
                                    був П----Ц, у когось були боки в читці, у когось у текстах - але це була справа часу і прагнення. Пацани вирішили є-ашити.
                                </p>
                                <p>
                                Минав час всі боки згладжувалися, але з назвою групи визначитися було складно. ONEAL запропонував  "БІТ Стомлених Мовчати (БІТУ.М.)" - схвалили всі. 
                                    Перший раз БІТУ.М.и виступили гуртом у Дніпрі, у ДІІТІ (трек дезорієнтація) все пройшло на ура. В Олександрії перший виступ був у
                                    центрі на пощі, якийсь мітинг (трек Олександрія).
                                </p>
                                <p>
                                Слідуючою була "Олександрiйська зiрка" - де хлопці, разом з командою бібоїв NEXT GENERATION YRTWIST з котрими познайомились на мітингу, 
                                    зірвали гран-прі.
                                </p>
                                <p>
                                Час летів - вони тусили на даху, читали під біт-бокс, Энер забомбив граффіті на даху котора внаслідок стала їх символом. 
                                    Далі БІТУ.М.и вирішили зробити свій фест, вони почали співпрацювати з Олександрійським БК Культури 
                                    (Вічна їм подяка за техніку та приміщення, хоча це їх робота).
                                </p>
                                <p>
                                Вирішено було зробити фестиваль на день міста (2004). На нього були запрошені 2 Олександрійські команди та Дніпропетровські ДІП 
                                    та колишня ДОГМА (БУТИ БРАТАМИ). Що стосується ДІПу, з ним ОНІЛ навчався в дієті на одному факу, у них було кілька спільних 
                                    треків та пара виступів у Дніпрі, одним з них була БИТВА ЗА ДНІПРО.
                                </p>
                                <p>
                                З командою Бути Братами, ONEAL та ДІП познайомилися дорогою на ІНДАХАУС, вирішено було створити проєкт ТРЄП 
                                    (записано кілька треків і знову пара виступів). Перший Олександрійський хіп-хоп фест пройшов нормально, людей було трохи, 
                                    але всім було весело. На самому паті склад Бітуму було поповнено ще одним учасником ДІП став п'ятим. Це був максимальний склад 
                                    за історію БІТУМа.
                                </p>
                                <p>
                                Після цього пройшла низка виступів в Олександрії, на деяких БІТУ.М. були організаторами. Вони набиралися досвіду, щоразу 
                                    опрацьовували свої помилки. Дема потихеньку відійшов від справ, ENERа забрали в армію, де він після термінової служби 
                                    підписав контракт ще на 3 роки. Часи настали складні, їх лишилося троє.
                                </p>
                                <p>
                                Незабаром у рідному місті їм стало тісно, все що можна було зробити в Олександрії було зроблено, почалися виступи на виїздах, 
                                    з цим було не складно ONEAL і ДІП вчилися в Дніпрі, а Влад вступив до Харкова - пацани знівечили Дніпро, Харків, Запоріжжя, Полтаву, 
                                    Бердянськ, також вони перебували у Федерації хіп-хопу м.Кам'янського (м.Дніпродзержинськ) 
                                    відчитали на кількох фестивалях доки федерація не розпалася.
                                </p>
                                <p>
                                У 2005 році до складу БІТУ.М.а увійшов WASP – молодий перспективний чувак з Олександрії, на жаль довгої спільної роботи з ним не вийшло – 
                                    було лише кілька спільних пісень, незабаром WASP став учасником іншого проєкту "Дядя Коля" з ними БІТУ.М.и підтримують дружні стосунки.
                                </p>
                                <p>
                                Після фестивалів у Бердянську та Полтаві було вирішено їхати до Харкова та шукати студію, яка б підходила стилю команди, 
                                    був обраний продюсерський центр BLACK&WIGHT family та студія HEDLINER records. Одна із записаних на студії пісень 
                                    (все, що в наших силах) була відібрана на збірку (hip-hop generation) від даного продюсерського центру.
                                </p>
                                <p>
                                17 лютого збірка була випущена на території Росії, протягом місяця вона надійшла у продаж на території України.
                                <p>
                                <p class="alert-content">
                                Продовження історії Бітума зараз в процесі розробки...
                                </p>`;
 
}

renderBitumAboutUs();
